#type_check.py
#برنامج لفحص انواع البيانات وتحويلها
#الجزء الاول :طباعة انواع القيم مع التوقعات في التعليقات
#(int) التوقع رقم صحيح
print(type("8080"))
#التوقع نص لانها بين علامات تنصيص (str)
print(type("198.51.100.7"))
#التوقع رقم عشري لوجود الفاصلة (float)
print(type(99.5))
#التوقع رقم صحيح والشرطة السفلية تساعد في قراءةة الارقام الكبيرة فقط (int)
print(type(1_000))
#الجزء الثاني : تحويل القيم وطباعتها مع النوع الجديد
#تحويل النص "443 الى رقم صحيح"
print(int("443"), type(int("443")))
#تحويل الرقم 8080 الى نص
print(str(8080), type(str(8080)))
#تحويل النص "2.5  الى رقم عشري 
print(float("2.5"), type(float("2.5")))